{
    "posts":
[{"id":1,
"title": "Victoria pulled out but how was the Commonwealth Games started by a Canadian sports journalist angry at perceived American arrogance?",
"body": "he great irony about the Commonwealth Games is that Britain nearly didn’t participate in the first-ever edition, called the British Empire Games, in 1930. Now, its existence itself is an irony in the post-colonial world of 2022, with a stale stench of a relic about it. And with Victoria pulling out of hosting, the relevance of Commonwealth Games has yet again come back into question",
"url": "https://www.fool.com/investing/2023/07/18/move-faang-1-unstoppable-magnificent-7-stock-buy/",
"image": "https://images.indianexpress.com/2023/07/CWG-2026.jpg?w=640"
},
{"id":2,
"title": "Federer + Nadal + Djokovic = Alcaraz",
"body": "A few weeks back Roger Federer was startled when he heard the lavish praise heaped on Carlos Alcaraz by his ex coach, the Croatian Ivan Ljubicic; that Alcaraz has a bit of Federer, Rafael Nadal, and Novak Djokovic. Federer’s response was not to put so much pressure on the kid – “He said that? … It’s a lot to live up to”. ",
"url": "https://biztoc.com/x/221287e08dd719b2",
"image": "https://images.indianexpress.com/2023/07/Alcaraz-1.jpg?w=640"
},
{"id":3,
"title": "Ajinkya Rahane, in a corner to save his Test career again",
"body": "As he prepares for the Trinidad Test starting Thursday, Ajinkya Rahane may be chuckling to himself thinking about selectors’ whims. Kept out of the , till he played some swashbuckling knocks for Chennai Super Kings in the Indian Premier League.",
"image": "https://images.indianexpress.com/2023/07/ajinkya-rahane-1.jpg?w=640"
},
{"id":4,

"title": "David Warner’s cryptic post before ENG vs AUS 4th Ashes Test",
"body": "David Warner has had a poor Ashes 2023 so far.   141 runs in three Tests at an average of just above 23, including one half-century.Warner’s struggles have been largely due to his  that he has been facing some excellent bowling from",
"url": "https://qz.com/elon-musks-brother-and-other-tesla-directors-settled-cl-1850650325",
"image": "https://images.indianexpress.com/2022/12/david-warner-ap.jpg?w=640"
},
{"id":5,
"title": "Move Over, FAANG: 1 Unstoppable \"Magnificent 7\" Stock to Buy Hand Over Fist",
"body": "The stock market has a new leadership group, but it features several familiar names.",
"url": "https://www.fool.com/investing/2023/07/18/move-faang-1-unstoppable-magnificent-7-stock-buy/",
"image": "https://g.foolcdn.com/editorial/images/739947/a-digital-rendering-of-computer-chips-with-one-labelled-ai.jpg"
}
]
}
